In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split

In [2]:
database = pd.read_excel("multiple_linear_regression.xlsx")
database.head(5)

                  Name  Age  Experience (Years)  Education (Years)    Salary
0  Mr. Johnathan Davis   56                   8                 15  14372.40
1           Kelly Reed   46                   7                 10  12641.59
2        Chelsea Moore   32                  11                 18  13918.89
3        Paige Goodwin   25                  33                 15  16396.54
4        Kelly Rosario   38                  32                 12  15350.48

In [3]:
database.drop(columns=("Name"), inplace=True)

In [4]:
database.head(5)

   Age  Experience (Years)  Education (Years)    Salary
0   56                   8                 15  14372.40
1   46                   7                 10  12641.59
2   32                  11                 18  13918.89
3   25                  33                 15  16396.54
4   38                  32                 12  15350.48

In [5]:
database.isnull().sum()

Age                   0
Experience (Years)    0
Education (Years)     0
Salary                0
dtype: int64

In [6]:
x = database.iloc[:,:-1]
y = database["Salary"]

In [7]:
from sklearn.preprocessing import StandardScaler

In [8]:
ss = StandardScaler()
ss.fit(x)
x = pd.DataFrame(ss.transform(x), columns=x.columns)

In [9]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [ ]:
from sklearn.neighbors import KNeighborsClassifier

In [ ]:
kc = KNeighborsClassifier(n_neighbors=5)
kc.fit(x_train, y_train)

In [ ]:
kc.score(x_test, y_test)* 100, kc.score(x_train, y_train)* 100

In [ ]:
for i in range(1, 30):
    kc1 = KNeighborsClassifier(n_neighbors=i)
    kc1.fit(x_train, y_train)
    print(i,kc1.score(x_test, y_test)* 100, kc1.score(x_train, y_train)* 100 )

In [ ]:
kc.predict([[56,8,15]])